# Задача 6: Счастливый билетик

# *Пример:*

# 385916 -> yes
# 123456 -> no

print("Введите любое шестизначное целое число")
#Вариант решения 1
n=int(input())
res=n//100000 + ((n//10000)%10) + ((n//1000)%10) == ((n//100)%10) + ((n//10)%10) + (n%10)

# Вариант решения 2
#n=input()
#res=(int(n[0]) + int(n[1]) + int(n[2])) == (int(n[3]) + int(n[4]) + int(n[5]))
if res==True:
    print(f"{n} -> yes")
else:
    print(f"{n} -> no")